### Terraform Plan — `sit` ✅

<details><summary>Show Plan</summary>

```
module.github_repos.github_repository.this["alone"]: Refreshing state... [id=alone]
module.github_repos.github_repository.this["Akshhay"]: Refreshing state... [id=Akshhay]
module.github_repos.github_repository.this["Dhyan"]: Refreshing state... [id=Dhyan]
module.github_repos.github_repository.this["sai3"]: Refreshing state... [id=sai3]
module.github_repos.github_repository.this["qwert"]: Refreshing state... [id=qwert]
module.github_repos.github_repository.this["den"]: Refreshing state... [id=den]
module.github_repos.github_repository.this["Sai"]: Refreshing state... [id=Sai]
module.github_repos.github_repository.this["Laddu"]: Refreshing state... [id=Laddu]
module.github_repos.github_repository.this["ahsys"]: Refreshing state... [id=ahsys]
module.github_repos.github_repository.this["tre"]: Refreshing state... [id=tre]
module.github_repos.github_repository.this["sai4"]: Refreshing state... [id=sai4]
module.github_repos.github_repository.this["lot"]: Refreshing state... [id=lot]
module.github_repos.github_repository.this["sai2"]: Refreshing state... [id=sai2]
module.github_repos.github_branch_default.this["sai3"]: Refreshing state... [id=sai3]
module.github_repos.github_branch_default.this["Sai"]: Refreshing state... [id=Sai]
module.github_repos.github_branch_default.this["alone"]: Refreshing state... [id=alone]
module.github_repos.github_branch_default.this["sai4"]: Refreshing state... [id=sai4]
module.github_repos.github_branch_default.this["lot"]: Refreshing state... [id=lot]
module.github_repos.github_branch_default.this["Dhyan"]: Refreshing state... [id=Dhyan]
module.github_repos.github_branch_default.this["ahsys"]: Refreshing state... [id=ahsys]
module.github_repos.github_branch_default.this["Laddu"]: Refreshing state... [id=Laddu]
module.github_repos.github_branch_default.this["sai2"]: Refreshing state... [id=sai2]
module.github_repos.github_branch_default.this["qwert"]: Refreshing state... [id=qwert]
module.github_repos.github_branch_default.this["tre"]: Refreshing state... [id=tre]
module.github_repos.github_branch_default.this["Akshhay"]: Refreshing state... [id=Akshhay]
module.github_repos.github_branch_default.this["den"]: Refreshing state... [id=den]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.github_repos.github_branch_default.this["Akshh"] will be created
  + resource "github_branch_default" "this" {
      + branch     = "main"
      + etag       = (known after apply)
      + id         = (known after apply)
      + rename     = false
      + repository = "Akshh"
    }

  # module.github_repos.github_branch_default.this["MAYBANK"] will be created
  + resource "github_branch_default" "this" {
      + branch     = "main"
      + etag       = (known after apply)
      + id         = (known after apply)
      + rename     = false
      + repository = "MAYBANK"
    }

  # module.github_repos.github_branch_default.this["YYCHAN"] will be created
  + resource "github_branch_default" "this" {
      + branch     = "main"
      + etag       = (known after apply)
      + id         = (known after apply)
      + rename     = false
      + repository = "YYCHAN"
    }

  # module.github_repos.github_branch_protection.main["Sai"] will be created
  + resource "github_branch_protection" "main" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = "R_kgDOROeCXA"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 2
          + restrict_dismissals             = false
        }
    }

  # module.github_repos.github_branch_protection.main["lot"] will be created
  + resource "github_branch_protection" "main" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = "R_kgDOROeD1w"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 2
          + restrict_dismissals             = false
        }
    }

  # module.github_repos.github_branch_protection.main["sai2"] will be created
  + resource "github_branch_protection" "main" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = "R_kgDOROeCfA"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 2
          + restrict_dismissals             = false
        }
    }

  # module.github_repos.github_repository.this["Akshh"] will be created
  + resource "github_repository" "this" {
      + allow_auto_merge                        = false
      + allow_forking                           = (known after apply)
      + allow_merge_commit                      = false
      + allow_rebase_merge                      = false
      + allow_squash_merge                      = true
      + archive_on_destroy                      = true
      + archived                                = false
      + default_branch                          = (known after apply)
      + delete_branch_on_merge                  = false
      + etag                                    = (known after apply)
      + fork                                    = (known after apply)
      + full_name                               = (known after apply)
      + git_clone_url                           = (known after apply)
      + has_discussions                         = false
      + has_issues                              = false
      + has_projects                            = false
      + has_wiki                                = true
      + html_url                                = (known after apply)
      + http_clone_url                          = (known after apply)
      + id                                      = (known after apply)
      + ignore_vulnerability_alerts_during_read = false
      + is_template                             = false
      + merge_commit_message                    = "PR_TITLE"
      + merge_commit_title                      = "MERGE_MESSAGE"
      + name                                    = "Akshh"
      + node_id                                 = (known after apply)
      + primary_language                        = (known after apply)
      + private                                 = (known after apply)
      + repo_id                                 = (known after apply)
      + source_owner                            = (known after apply)
      + source_repo                             = (known after apply)
      + squash_merge_commit_message             = "COMMIT_MESSAGES"
      + squash_merge_commit_title               = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url                           = (known after apply)
      + svn_url                                 = (known after apply)
      + topics                                  = [
          + "integration-testing",
          + "sit",
          + "terraform-managed",
        ]
      + visibility                              = "private"
      + vulnerability_alerts                    = true
      + web_commit_signoff_required             = false
        # (1 unchanged attribute hidden)

      + security_and_analysis {
          + advanced_security {
              + status = "enabled"
            }
          + secret_scanning {
              + status = "enabled"
            }
          + secret_scanning_push_protection {
              + status = "enabled"
            }
        }
    }

  # module.github_repos.github_repository.this["Akshhay"] will be updated in-place
  ~ resource "github_repository" "this" {
      + archive_on_destroy                      = true
        id                                      = "Akshhay"
      + ignore_vulnerability_alerts_during_read = false
        name                                    = "Akshhay"
      ~ visibility                              = "public" -> "private"
      ~ vulnerability_alerts                    = false -> true
        # (38 unchanged attributes hidden)

      ~ security_and_analysis {
          + advanced_security {
              + status = "enabled"
            }

            # (2 unchanged blocks hidden)
        }
    }

  # module.github_repos.github_repository.this["Dhyan"] will be updated in-place
  ~ resource "github_repository" "this" {
      + archive_on_destroy                      = true
        id                                      = "Dhyan"
      + ignore_vulnerability_alerts_during_read = false
        name                                    = "Dhyan"
      ~ visibility                              = "public" -> "private"
      ~ vulnerability_alerts                    = false -> true
        # (38 unchanged attributes hidden)

      ~ security_and_analysis {
          + advanced_security {
              + status = "enabled"
            }

            # (2 unchanged blocks hidden)
        }
    }

  # module.github_repos.github_repository.this["Laddu"] will be updated in-place
  ~ resource "github_repository" "this" {
      + archive_on_destroy                      = true
        id                                      = "Laddu"
      + ignore_vulnerability_alerts_during_read = false
        name                                    = "Laddu"
      ~ visibility                              = "public" -> "private"
      ~ vulnerability_alerts                    = false -> true
        # (38 unchanged attributes hidden)

      ~ security_and_analysis {
          + advanced_security {
              + status = "enabled"
            }

            # (2 unchanged blocks hidden)
        }
    }

  # module.github_repos.github_repository.this["MAYBANK"] will be created
  + resource "github_repository" "this" {
      + allow_auto_merge                        = false
      + allow_forking                           = (known after apply)
      + allow_merge_commit                      = false
      + allow_rebase_merge                      = false
      + allow_squash_merge                      = true
      + archive_on_destroy                      = true
      + archived                                = false
      + default_branch                          = (known after apply)
      + delete_branch_on_merge                  = false
      + description                             = "NI"
      + etag                                    = (known after apply)
      + fork                                    = (known after apply)
      + full_name                               = (known after apply)
      + git_clone_url                           = (known after apply)
      + has_discussions                         = false
      + has_issues                              = false
      + has_projects                            = false
      + has_wiki                                = true
      + html_url                                = (known after apply)
      + http_clone_url                          = (known after apply)
      + id                                      = (known after apply)
      + ignore_vulnerability_alerts_during_read = false
      + is_template                             = false
      + merge_commit_message                    = "PR_TITLE"
      + merge_commit_title                      = "MERGE_MESSAGE"
      + name                                    = "MAYBANK"
      + node_id                                 = (known after apply)
      + primary_language                        = (known after apply)
      + private                                 = (known after apply)
      + repo_id                                 = (known after apply)
      + source_owner                            = (known after apply)
      + source_repo                             = (known after apply)
      + squash_merge_commit_message             = "COMMIT_MESSAGES"
      + squash_merge_commit_title               = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url                           = (known after apply)
      + svn_url                                 = (known after apply)
      + topics                                  = [
          + "integration-testing",
          + "sit",
          + "terraform-managed",
        ]
      + visibility                              = "private"
      + vulnerability_alerts                    = true
      + web_commit_signoff_required             = false

      + security_and_analysis {
          + advanced_security {
              + status = "enabled"
            }
          + secret_scanning {
              + status = "enabled"
            }
          + secret_scanning_push_protection {
              + status = "enabled"
            }
        }
    }

  # module.github_repos.github_repository.this["Sai"] will be updated in-place
  ~ resource "github_repository" "this" {
      + archive_on_destroy                      = true
        id                                      = "Sai"
      + ignore_vulnerability_alerts_during_read = false
        name                                    = "Sai"
      ~ visibility                              = "public" -> "private"
      ~ vulnerability_alerts                    = false -> true
        # (38 unchanged attributes hidden)

      ~ security_and_analysis {
          + advanced_security {
              + status = "enabled"
            }

            # (2 unchanged blocks hidden)
        }
    }

  # module.github_repos.github_repository.this["YYCHAN"] will be created
  + resource "github_repository" "this" {
      + allow_auto_merge                        = false
      + allow_forking                           = (known after apply)
      + allow_merge_commit                      = false
      + allow_rebase_merge                      = false
      + allow_squash_merge                      = true
      + archive_on_destroy                      = true
      + archived                                = false
      + default_branch                          = (known after apply)
      + delete_branch_on_merge                  = false
      + description                             = "NA"
      + etag                                    = (known after apply)
      + fork                                    = (known after apply)
      + full_name                               = (known after apply)
      + git_clone_url                           = (known after apply)
      + has_discussions                         = false
      + has_issues                              = false
      + has_projects                            = false
      + has_wiki                                = true
      + html_url                                = (known after apply)
      + http_clone_url                          = (known after apply)
      + id                                      = (known after apply)
      + ignore_vulnerability_alerts_during_read = false
      + is_template                             = false
      + merge_commit_message                    = "PR_TITLE"
      + merge_commit_title                      = "MERGE_MESSAGE"
      + name                                    = "YYCHAN"
      + node_id                                 = (known after apply)
      + primary_language                        = (known after apply)
      + private                                 = (known after apply)
      + repo_id                                 = (known after apply)
      + source_owner                            = (known after apply)
      + source_repo                             = (known after apply)
      + squash_merge_commit_message             = "COMMIT_MESSAGES"
      + squash_merge_commit_title               = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url                           = (known after apply)
      + svn_url                                 = (known after apply)
      + topics                                  = [
          + "integration-testing",
          + "sit",
          + "terraform-managed",
        ]
      + visibility                              = "private"
      + vulnerability_alerts                    = true
      + web_commit_signoff_required             = false

      + security_and_analysis {
          + advanced_security {
              + status = "enabled"
            }
          + secret_scanning {
              + status = "enabled"
            }
          + secret_scanning_push_protection {
              + status = "enabled"
            }
        }
    }

  # module.github_repos.github_repository.this["ahsys"] will be updated in-place
  ~ resource "github_repository" "this" {
      + archive_on_destroy                      = true
        id                                      = "ahsys"
      + ignore_vulnerability_alerts_during_read = false
        name                                    = "ahsys"
      ~ visibility                              = "public" -> "private"
      ~ vulnerability_alerts                    = false -> true
        # (38 unchanged attributes hidden)

      ~ security_and_analysis {
          + advanced_security {
              + status = "enabled"
            }

            # (2 unchanged blocks hidden)
        }
    }

  # module.github_repos.github_repository.this["alone"] will be updated in-place
  ~ resource "github_repository" "this" {
      + archive_on_destroy                      = true
        id                                      = "alone"
      + ignore_vulnerability_alerts_during_read = false
        name                                    = "alone"
      ~ visibility                              = "public" -> "private"
      ~ vulnerability_alerts                    = false -> true
        # (38 unchanged attributes hidden)

      ~ security_and_analysis {
          + advanced_security {
              + status = "enabled"
            }

            # (2 unchanged blocks hidden)
        }
    }

  # module.github_repos.github_repository.this["den"] will be updated in-place
  ~ resource "github_repository" "this" {
      + archive_on_destroy                      = true
        id                                      = "den"
      + ignore_vulnerability_alerts_during_read = false
        name                                    = "den"
      ~ visibility                              = "public" -> "private"
      ~ vulnerability_alerts                    = false -> true
        # (38 unchanged attributes hidden)

      ~ security_and_analysis {
          + advanced_security {
              + status = "enabled"
            }

            # (2 unchanged blocks hidden)
        }
    }

  # module.github_repos.github_repository.this["lot"] will be updated in-place
  ~ resource "github_repository" "this" {
      + archive_on_destroy                      = true
        id                                      = "lot"
      + ignore_vulnerability_alerts_during_read = false
        name                                    = "lot"
      ~ visibility                              = "public" -> "private"
      ~ vulnerability_alerts                    = false -> true
        # (38 unchanged attributes hidden)

      ~ security_and_analysis {
          + advanced_security {
              + status = "enabled"
            }

            # (2 unchanged blocks hidden)
        }
    }

  # module.github_repos.github_repository.this["qwert"] will be updated in-place
  ~ resource "github_repository" "this" {
      + archive_on_destroy                      = true
        id                                      = "qwert"
      + ignore_vulnerability_alerts_during_read = false
        name                                    = "qwert"
      ~ visibility                              = "public" -> "private"
      ~ vulnerability_alerts                    = false -> true
        # (38 unchanged attributes hidden)

      ~ security_and_analysis {
          + advanced_security {
              + status = "enabled"
            }

            # (2 unchanged blocks hidden)
        }
    }

  # module.github_repos.github_repository.this["sai2"] will be updated in-place
  ~ resource "github_repository" "this" {
      + archive_on_destroy                      = true
        id                                      = "sai2"
      + ignore_vulnerability_alerts_during_read = false
        name                                    = "sai2"
      ~ visibility                              = "public" -> "private"
      ~ vulnerability_alerts                    = false -> true
        # (38 unchanged attributes hidden)

      ~ security_and_analysis {
          + advanced_security {
              + status = "enabled"
            }

            # (2 unchanged blocks hidden)
        }
    }

  # module.github_repos.github_repository.this["sai3"] will be updated in-place
  ~ resource "github_repository" "this" {
      + archive_on_destroy                      = true
        id                                      = "sai3"
      + ignore_vulnerability_alerts_during_read = false
        name                                    = "sai3"
      ~ visibility                              = "public" -> "private"
      ~ vulnerability_alerts                    = false -> true
        # (38 unchanged attributes hidden)

      ~ security_and_analysis {
          + advanced_security {
              + status = "enabled"
            }

            # (2 unchanged blocks hidden)
        }
    }

  # module.github_repos.github_repository.this["sai4"] will be updated in-place
  ~ resource "github_repository" "this" {
      + archive_on_destroy                      = true
        id                                      = "sai4"
      + ignore_vulnerability_alerts_during_read = false
        name                                    = "sai4"
      ~ visibility                              = "public" -> "private"
      ~ vulnerability_alerts                    = false -> true
        # (38 unchanged attributes hidden)

      ~ security_and_analysis {
          + advanced_security {
              + status = "enabled"
            }

            # (2 unchanged blocks hidden)
        }
    }

  # module.github_repos.github_repository.this["tre"] will be updated in-place
  ~ resource "github_repository" "this" {
      + archive_on_destroy                      = true
        id                                      = "tre"
      + ignore_vulnerability_alerts_during_read = false
        name                                    = "tre"
      ~ visibility                              = "public" -> "private"
      ~ vulnerability_alerts                    = false -> true
        # (38 unchanged attributes hidden)

      ~ security_and_analysis {
          + advanced_security {
              + status = "enabled"
            }

            # (2 unchanged blocks hidden)
        }
    }

  # module.github_repos.github_repository_dependabot_security_updates.this["Akshh"] will be created
  + resource "github_repository_dependabot_security_updates" "this" {
      + enabled    = true
      + id         = (known after apply)
      + repository = "Akshh"
    }

  # module.github_repos.github_repository_dependabot_security_updates.this["Akshhay"] will be created
  + resource "github_repository_dependabot_security_updates" "this" {
      + enabled    = true
      + id         = (known after apply)
      + repository = "Akshhay"
    }

  # module.github_repos.github_repository_dependabot_security_updates.this["Dhyan"] will be created
  + resource "github_repository_dependabot_security_updates" "this" {
      + enabled    = true
      + id         = (known after apply)
      + repository = "Dhyan"
    }

  # module.github_repos.github_repository_dependabot_security_updates.this["Laddu"] will be created
  + resource "github_repository_dependabot_security_updates" "this" {
      + enabled    = true
      + id         = (known after apply)
      + repository = "Laddu"
    }

  # module.github_repos.github_repository_dependabot_security_updates.this["MAYBANK"] will be created
  + resource "github_repository_dependabot_security_updates" "this" {
      + enabled    = true
      + id         = (known after apply)
      + repository = "MAYBANK"
    }

  # module.github_repos.github_repository_dependabot_security_updates.this["Sai"] will be created
  + resource "github_repository_dependabot_security_updates" "this" {
      + enabled    = true
      + id         = (known after apply)
      + repository = "Sai"
    }

  # module.github_repos.github_repository_dependabot_security_updates.this["YYCHAN"] will be created
  + resource "github_repository_dependabot_security_updates" "this" {
      + enabled    = true
      + id         = (known after apply)
      + repository = "YYCHAN"
    }

  # module.github_repos.github_repository_dependabot_security_updates.this["ahsys"] will be created
  + resource "github_repository_dependabot_security_updates" "this" {
      + enabled    = true
      + id         = (known after apply)
      + repository = "ahsys"
    }

  # module.github_repos.github_repository_dependabot_security_updates.this["alone"] will be created
  + resource "github_repository_dependabot_security_updates" "this" {
      + enabled    = true
      + id         = (known after apply)
      + repository = "alone"
    }

  # module.github_repos.github_repository_dependabot_security_updates.this["den"] will be created
  + resource "github_repository_dependabot_security_updates" "this" {
      + enabled    = true
      + id         = (known after apply)
      + repository = "den"
    }

  # module.github_repos.github_repository_dependabot_security_updates.this["lot"] will be created
  + resource "github_repository_dependabot_security_updates" "this" {
      + enabled    = true
      + id         = (known after apply)
      + repository = "lot"
    }

  # module.github_repos.github_repository_dependabot_security_updates.this["qwert"] will be created
  + resource "github_repository_dependabot_security_updates" "this" {
      + enabled    = true
      + id         = (known after apply)
      + repository = "qwert"
    }

  # module.github_repos.github_repository_dependabot_security_updates.this["sai2"] will be created
  + resource "github_repository_dependabot_security_updates" "this" {
      + enabled    = true
      + id         = (known after apply)
      + repository = "sai2"
    }

  # module.github_repos.github_repository_dependabot_security_updates.this["sai3"] will be created
  + resource "github_repository_dependabot_security_updates" "this" {
      + enabled    = true
      + id         = (known after apply)
      + repository = "sai3"
    }

  # module.github_repos.github_repository_dependabot_security_updates.this["sai4"] will be created
  + resource "github_repository_dependabot_security_updates" "this" {
      + enabled    = true
      + id         = (known after apply)
      + repository = "sai4"
    }

  # module.github_repos.github_repository_dependabot_security_updates.this["tre"] will be created
  + resource "github_repository_dependabot_security_updates" "this" {
      + enabled    = true
      + id         = (known after apply)
      + repository = "tre"
    }

  # module.github_repos.github_repository_ruleset.this["lot"] will be created
  + resource "github_repository_ruleset" "this" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "lot-protection"
      + node_id     = (known after apply)
      + repository  = "lot"
      + ruleset_id  = (known after apply)
      + target      = "branch"

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "~DEFAULT_BRANCH",
                ]
            }
        }

      + rules {
          + creation                      = false
          + deletion                      = true
          + non_fast_forward              = true
          + required_linear_history       = false
          + required_signatures           = false
          + update_allows_fetch_and_merge = false

          + pull_request {
              + allowed_merge_methods             = (known after apply)
              + dismiss_stale_reviews_on_push     = true
              + require_code_owner_review         = false
              + require_last_push_approval        = false
              + required_approving_review_count   = 1
              + required_review_thread_resolution = false
            }
        }
    }

  # module.github_repos.github_repository_ruleset.this["sai2"] will be created
  + resource "github_repository_ruleset" "this" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "sai2-protection"
      + node_id     = (known after apply)
      + repository  = "sai2"
      + ruleset_id  = (known after apply)
      + target      = "branch"

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "~DEFAULT_BRANCH",
                ]
            }
        }

      + rules {
          + creation                      = false
          + deletion                      = true
          + non_fast_forward              = true
          + required_linear_history       = false
          + required_signatures           = false
          + update_allows_fetch_and_merge = false

          + pull_request {
              + allowed_merge_methods             = (known after apply)
              + dismiss_stale_reviews_on_push     = true
              + require_code_owner_review         = false
              + require_last_push_approval        = false
              + required_approving_review_count   = 1
              + required_review_thread_resolution = false
            }
        }
    }

Plan: 27 to add, 13 to change, 0 to destroy.

Warning: Resource targeting is in effect

You are creating a plan with the -target option, which means that the result
of this plan may not represent all of the changes requested by the current
configuration.

The -target option is not for routine use, and is provided only for
exceptional situations such as recovering from errors or mistakes, or when
Terraform specifically suggests to use it as part of an error message.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>